---
kind: enumMember
id: F:Autodesk.Revit.DB.FailureResolutionType.DeleteElements
enum: Autodesk.Revit.DB.FailureResolutionType
source: html/786e6422-f66d-5320-99f9-e530819e50a1.htm
---
# Autodesk.Revit.DB.FailureResolutionType.DeleteElements

Defines a resolution of a failure by deleting Element(s) that caused the failure.